tutorials/fsi/cylinderFlap_FSI3_manifoldMapping/fluid-level-0/constant/dynamicMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          motionProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

solver RBFMeshMotionSolver;

movingPatches ( plate );

staticPatches ( );

fixedPatches ( cylinder outlet inlet top bottom );

coarsening
{
  enabled false;
  tol 1.0e-6;
  minPoints 10;
  maxPoints 2000;
  livePointSelection true;
  tolLivePointSelection 1.0e-5;
  exportSelectedPoints false;
}

interpolation
{
  function TPS;
}
