tutorials/fsi/cylinderFlap_FSI3_manifoldMapping/fluid-level-0/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object fvSolution;
}

solvers
{
  p
  {
    solver PCG;
    preconditioner DIC;
    tolerance 1e-13;
    relTol 0.001;
  }

  U
  {
    solver BiCGStab;
    preconditioner DILU;
    tolerance 1e-13;
    relTol 0.001;
  }
}

PIMPLE
{
  nOuterCorrectors 500;
  nCorrectors 5;
  nNonOrthogonalCorrectors 0;
  convergenceTolerance 1.0e-12;
}

relaxationFactors
{
  U 0.9;
}
